---
kind: other
id: Methods.T:Autodesk.Revit.DB.Transform1D
source: html/251e24c2-e433-b31e-48dc-d229ef30d49d.htm
---
# Transform1D Methods

Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).